Revit 2027 API
RebarConstrainedHandle.IsDraggable Method
 Checks that the RebarConstrainedHandle can be draggable in canvas (it has drag controls while editing constraints).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDraggable()
Public Function IsDraggable As Boolean
public:
bool IsDraggable()
member IsDraggable : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle can be draggable in canvas (it has drag controls while editing constraints).
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace